
/**
 * リアルの時間経過と共に自律的にフレームを更新していくシーンを表す。GlassScene から派生している。
 *
 * start() すると定期的に処理を行うので、不要になったら stop() か dispose() する必要がある。
 */
class TimeScene extends GlassScene {

    // staticメンバ
    //======================================================================================================

    //------------------------------------------------------------------------------------------------------
    /**
     * 引数で指定されたFPSにおける、1フレームあたりの時間を返す。
     *
     * @param   フレームレート。
     * @return  1フレームあたりの時間(ミリ秒)
     */
    static getFrameTime(fps) {

        return Math.floor(1000 / fps);
    }


    // インスタンスメンバ
    //======================================================================================================

    //------------------------------------------------------------------------------------------------------
    /**
     * @param   描画対象となる <canvas> 要素かそのid値。
     */
    _constructor(canvas) {
        super._constructor(canvas);

        // 最大フレームレート。
        // ポーリング間隔が12～20msくらいなので、20～80fps をセットしていると実際はもう少し下がる可能性がある。
        this.framerate = 120;

        // 最小フレームレート。実際のフレームレートがこの値を下回るとスローになる。
        this.minrate = 10;

        // フレーム開始時間。start()が一回でも呼ばれたかどうかのフラグも兼ねている。
        this.now = 0;

        // 動作中かどうか。
        this.playing = false;

        // このフラグがtrueになっている場合はフレームを自動では進めない。デバッグ用。
        this.debugstop = false;

        // poll() のthisを固定した関数を取得。コールバックで使う。
        this.bindedPoll = this.poll.bind(this);
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * 進行を開始・続行する。
     */
    start() {

        // もう開始されているなら何もしない。
        if(this.playing)  return;

        // フラグ等を更新して次のウィンドウ更新を待つ。
        this.playing = true;
        this.now = performance.now();
        window.requestAnimationFrame(this.bindedPoll);
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * 停止する。
     */
    stop() {

        this.playing = false;
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * requestAnimationFrame() などで定期的にコールされる。
     *
     * @param   現在のタイムスタンプ。
     */
    poll(timestamp) {

        // 停止中なら何もしない。
        if(!this.playing)  return;

        // 次のポーリングを依頼しておく。
        window.requestAnimationFrame(this.bindedPoll);

        // デバッグ用のストップフラグがONになっている場合は処理しない。
        if(this.debugstop)  return;

        // 最大フレームレートにおける1フレームあたりの時間が、前回実行から経過しているなら処理する。
        if(this.now + TimeScene.getFrameTime(this.framerate) <= timestamp)
            this.tick(timestamp);
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * 引数で指定された値を現在時間(ms)として、新しいフレームを一つ刻む。
     *
     * @param   現在のタイムスタンプ。省略した場合は時間を進めずにフレームを再描画する(frame() のコールと等価)。
     */
    tick(timestamp) {

        // 引数省略時は時間を進めない。
        if(timestamp == undefined)  timestamp = this.now;

        // 経過時間を取得。ただし、最低フレームレートで求められる以上の時間を経過させない。
        var delta = Math.min( timestamp - this.now, TimeScene.getFrameTime(this.minrate) );

        // 現在のタイムスタンプを更新。
        this.now = timestamp;

        // 経過時間とともにフレームを処理する。
        this.frame(delta);
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * オーバーライド。このシーンオブジェクトを破棄するときの処理を行う。
     */
    dispose() {

        this.stop();
        return super.dispose();
    }
}
