/**
 * BrushParticleにおいてパーティクルの描画を行うオブジェクト(パーティクルブラシ)を収める。
 */

//=========================================================================================================
/**
 * パーティクルブラシの基底。
 */
class ParticleBrush {

    //------------------------------------------------------------------------------------------------------
    /**
     * パーティクルがミストに追加される直前のタイミングで呼ばれる。
     * 普通、コンストラクタで初期化を行うがコンストラクタではパラメータがまだ安定していないので、パラメータ決定後に行いたい初期化処理があるならここで行う。
     *
     * @param   このブラシの持ち主となっているパーティクル。
     * @param   パーティクルを追加しようとしているミスト実行素子。
     */
    takeup(particle, mist) {
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * 指定された位置と経過率を参照して、描画を行う。
     *
     * @param   描画先となる CanvasRenderingContext2D
     * @param   描画位置を表すPoint
     * @param   寿命経過率。0%を0.0、100%を1.0で表現する。
     */
    plash(context, point, age) {

        throw new Error("実装して下さい");
    }
}


//=========================================================================================================
/**
 * 単純に丸で描画するブラシ。
 */
class BallBrush extends ParticleBrush {

    //------------------------------------------------------------------------------------------------------
    /**
     * @param   色
     * @param   大きさ(直径)。
     */
    constructor(color, size) {
        super();

        this.color = color || "white";
        this.size = size || 40;
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * 抽象メソッド実装。指定された位置と経過率を参照して、描画を行う。
     */
    plash(context, point, age) {

        context.beginPath();
        context.arc(point.x, point.y, this.size/2, 0, Math.PI360);
        context.fillStyle = this.color;
        context.fill();
    }
}


//=========================================================================================================
/**
 * 経過率に従って小さくなる丸で描画するブラシ。
 */
class MeltBall extends BallBrush {

    //------------------------------------------------------------------------------------------------------
    /**
     * オーバーライド。パーティクルがミストに追加される直前のタイミングで呼ばれる。
     */
    takeup(particle, mist) {

        // 最初のサイズを取っておく。
        this.birthsize = this.size;
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * オーバーライド。指定された位置と経過率を参照して、描画を行う。
     */
    plash(context, point, age) {

        this.size = this.birthsize * (1.0 - age);

        super.plash(context, point, age);
    }
}


//=========================================================================================================
/**
 * 経過率に従って薄くなる丸で描画するブラシ。
 */
class FadeBall extends BallBrush {

    //------------------------------------------------------------------------------------------------------
    /**
     * オーバーライド。指定された位置と経過率を参照して、描画を行う。
     */
    plash(context, point, age) {

        var alpha = 1.0 - age;

        // セットされたアルファを適用。
        var nature = context.globalAlpha;
        context.globalAlpha *= alpha;

        // 描画。
        super.plash(context, point, age);

        // アルファを戻す。
        context.globalAlpha = nature;
    }
}


//=========================================================================================================
/**
 * 指定されたイメージで描画するブラシ。
 */
class ImageBrush extends ParticleBrush {

    //------------------------------------------------------------------------------------------------------
    /**
     * @param   描画するイメージ。Assetのキー名か、<img> や <canvas>、あるいは ImagePiece インスタンス。
     */
    constructor(image) {
        super();

        this.image = image;
    }

    //---------------------------------------------------------------------------------------------------------
    /**
     * 描画するイメージ。
     * セットするときはAssetのキー名か、<img> や <canvas>、あるいは ImagePiece インスタンスを指定する。
     */
    get image() {
        return this._image;
    }
    set image(value) {

        this._image = Asset.needAs(value, CanvasImageSource);
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * 抽象メソッド実装。
     */
    plash(context, point, age) {

        context.centerImage(this.image, point.x, point.y);
    }
}
