/**
 * 汎用性を捨てて、よくある動きに特化した移動器を収める。
 */

//==========================================================================================================
/**
 * 指定されたベクトルを線形的に行って戻ってくる移動器。ピコッとする。
 */
class PikoMover extends WalkMover {

    //------------------------------------------------------------------------------------------------------
    /**
     * @param   最も離れるタイミングでの移動ベクトルをPointで示す。
     * @param   行って戻ってくるまで何msかけるか。
     */
    constructor(apex, duration) {

        // 線形的に行って戻ってくる補間器を作成。
        var pingpong = new PingpongPolator(new RisePolator(2));

        // 指定されたベクトルに対してその補間器で作用するウォーカーを作成。
        var walker = new LineWalker({polator:pingpong, dest:apex});

        // これで基底クラスのパラメータが揃う。
        super(walker, duration);
    }
}
