/**
 * 与えられた値に対して、決められたルールに従って値を返す「補間器」を収めたファイル。
 *
 * 0.0～1.0 の範囲の値を受け取り -1.0～+1.0 の範囲の値を返すのが主眼だが、範囲外の値を受けてもそれなりの値を返す。
 *
 * 補間器を入れ子にすることで様々な数値変化を表現できる。
 *
 *      // 補間器テストコード
 *      var p = new Interpolator();
 *      console.log( "-2.0  => " + p.treat(-2.0)  );
 *      console.log( "-1.0  => " + p.treat(-1.0)  );
 *      console.log( "-0.5  => " + p.treat(-0.5)  );
 *      console.log( " 0    => " + p.treat( 0)    );
 *      console.log( "+0.25 => " + p.treat(+0.25) );
 *      console.log( "+0.5  => " + p.treat(+0.5)  );
 *      console.log( "+0.75 => " + p.treat(+0.75) );
 *      console.log( "+1.0  => " + p.treat(+1.0)  );
 *      console.log( "+2.0  => " + p.treat(+2.0)  );
 *      console.log( "+3.0  => " + p.treat(+3.0)  );
 */

//==========================================================================================================
/**
 * 基底クラス。
 */
class Interpolator {

    //------------------------------------------------------------------------------------------------------
    /**
     * 静的メソッド。補間器の指定を正規化する。
     *
     * @param   補間器のインスタンスかクラス名。クラス名を指定する場合は "LinearPolator" なら "linear" とする。
     *          undefined を指定した場合は LinearPolator だが、null の場合は null が返る。
     * @return  正規化した結果の補間器。
     */
    static normalize(polator) {

        if(polator === null)
            return null;

        if(polator === undefined)
            polator = "linear";

        // 文字列で指定されている場合、インスタンスに変換する。
        if(typeof(polator) == "string") {
            var name = polator.ucfirst() + "Polator";
            polator = new (eval(name))();               // class宣言はwindowに格納されないからeval使わざるをえない。
        }

        return polator;
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * @param   内部補間器。補間器を入れ子にする場合に、前提となる補間器を指定する。"linear" などのクラス名前半で指定することもできる。
     */
    constructor(factor) {

        this.factor = factor;
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * 指定された値に対応する値を取り出す。
     */
    elicit(x) {

        // 前提の補間器があるならまずその処理。
        if(this.factor)  x = this.factor.elicit(x);

        // その後でオリジナルの処理。
        return this.treat(x);
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * 指定された値に対するこのクラスにおける処理を行う。
     */
    treat(x) {

        // 基底としては何もしない。
        return x;
    }
}


//==========================================================================================================
/**
 * 与えられた値をそのまま返す最も単純な補間器。
 */
class LinearPolator extends Interpolator {
}


//==========================================================================================================
/**
 * 最初は遅く徐々に加速する補間器。
 */
class EaseoutPolator extends Interpolator {

    //------------------------------------------------------------------------------------------------------
    /**
     * @param   冪指数。高いほど傾向が強くなる。省略時は 3。
     * @param   内部補間器。補間器を入れ子にする場合に、前提となる補間器を指定する。"linear" などのクラス名前半で指定することもできる。
     */
    constructor(pow, factor) {
        super(factor);
        this.pow = pow || 3;
    }

    //------------------------------------------------------------------------------------------------------
    treat(x) {
        return Math.pow(x, this.pow);
    }
}

/**
 * その逆版。最初は速く徐々にブレーキをかける。
 * EaseoutPolator とつなげても左右対称にはならない。その必要があるなら TriginPolator, TrigoutPolator を使うと良い。
 */
class EaseinPolator extends Interpolator {

    constructor(pow, factor) {
        super(factor);
        this.pow = pow || 3;
    }

    treat(x) {
        return Math.pow(x, 1/this.pow);
    }
}

//==========================================================================================================
/**
 * 三角関数を使ったイーズアウト。
 */
class TrigoutPolator extends Interpolator {

    //------------------------------------------------------------------------------------------------------
    treat(x) {
        return Math.sin(Math.PI270 + Math.PI90 * x) + 1.0;
    }
}

/**
 * 三角関数を使ったイーズイン。
 */
class TriginPolator extends Interpolator {

    //------------------------------------------------------------------------------------------------------
    treat(x) {
        return Math.sin(Math.PI90 * x);
    }
}



//==========================================================================================================
/**
 * 正弦波を表す補間器。1.0でちょうど一週目を表す。つまり、0.25で1を、0.5で0を、0.75で-1を返す。
 */
class SinPolator extends Interpolator {

    treat(x) {
        return Math.sin(Math.PI * 2 * x);
    }
}

/**
 * 余弦波を表す補間器。1.0でちょうど一週目を表す。つまり、0.25で0を、0.5で-1を、0.75で0を返す。
 */
class CosPolator extends Interpolator {

    treat(x) {
        return Math.cos(Math.PI * 2 * x);
    }
}


//==========================================================================================================
/**
 * 0.0-1.0を超えた数値を与えるとそれぞれの境界値でストップする補間器。つまり一律的に 0 未満を 0.0、1 以上を 1.0 とする。
 */
class StopPolator extends Interpolator {

    treat(x) {

        if(x <= 0.0)  return 0.0;
        if(1.0 <= x)  return 1.0;
        return x;
    }
}


//==========================================================================================================
/**
 * 0.0-1.0を超えた数値を与えると反対側にループする補間器。つまり次のようになる。
 *     -0.25 => 0.75
 *      0.00 => 0.00
 *      0.25 => 0.25
 *      0.50 => 0.50
 *      0.75 => 0.75
 *      1.00 => 1.00
 *      1.25 => 0.25
 */
class LoopPolator extends Interpolator {

    treat(x) {

        if(x < 0.0)  return 1.0 + (x % 1.0);
        if(1.0 < x)  return x % 1.0;
        return x;
    }
}


//==========================================================================================================
/**
 * 0.0-1.0を超えた数値を与えるとその範囲を行ったり来たりする補間器。つまり次のように処理する。
 *     -0.25 => 0.25
 *      0.00 => 0.00
 *      0.25 => 0.25
 *      0.50 => 0.50
 *      0.75 => 0.75
 *      1.00 => 1.00
 *      1.25 => 0.75
 */
class PingpongPolator extends Interpolator {

    treat(x) {

        if(x < 0)  x *= -1;

        if(2.0 < x)  x %= 2.0;

        if(1.0 < x)  x = 2.0 - x;

        return x;
    }
}


//==========================================================================================================
/**
 * 定義された倍率を掛ける補間器。
 */
class RisePolator extends Interpolator {

    //------------------------------------------------------------------------------------------------------
    /**
     * @param   掛ける値。
     * @param   内部補間器。補間器を入れ子にする場合に、前提となる補間器を指定する。"linear" などのクラス名前半で指定することもできる。
     */
    constructor(riser, factor) {
        super(factor);

        this.riser = riser;
    }

    //------------------------------------------------------------------------------------------------------
    treat(x) {
        return x * this.riser;
    }
}


//==========================================================================================================
/**
 * 0.0～1.0を逆転させる補間器。0が指定されれば1を、1が指定されれば0を返す。
 * y = 0.5 の直線で上下反転させたようなグラフを生成する。つまり次のように処理する。
 *     -0.25 => 1.25
 *      0.00 => 1.00
 *      0.25 => 0.75
 *      0.50 => 0.50
 *      0.75 => 0.25
 *      1.00 => 0.00
 *      1.25 =>-0.25
 */
class ReversalPolator extends Interpolator {

    treat(x) {
        return Math.mirror(x, 0.5);
    }
}
